---
type: FaceSecondDerivatives
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# FaceSecondDerivatives

`Autodesk.Revit.DB.FaceSecondDerivatives` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MixedDerivative | 2016 | `public XYZ MixedDerivative { get ; }` |
| Property | UUDerivative | 2016 | `public XYZ UUDerivative { get ; }` |
| Property | VVDerivative | 2016 | `public XYZ VVDerivative { get ; }` |